html/20231126T003848--org-roam__emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>org roam</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">16 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231126T003848--org-roam__emacs.html">org roam</a></h1>
<p>
Quite old notes about using org-roam package in emacs.
</p>

<ol class="org-ol">
<li><a href="https://youtu.be/AyhPmypHDEw">Getting Started with Org Roam - Build a Second Brain in Emacs</a> <a href="https://systemcrafters.cc/build-a-second-brain-in-emacs/getting-started-with-org-roam/">shownotes</a></li>
<li><a href="https://youtu.be/YxgA5z2R08I">Capturing Notes Efficiently in Emacs with Org Roam</a> <a href="https://systemcrafters.net/build-a-second-brain-in-emacs/capturing-notes-efficiently/">shownotes</a></li>
<li><a href="https://youtu.be/3-sLBaJAtew">Org Roam: The Best Way to Keep a Journal in Emacs</a> <a href="https://systemcrafters.net/build-a-second-brain-in-emacs/keep-a-journal/">shownotes</a></li>
<li><a href="https://youtu.be/CUkuyW6hr18">5 Org Roam Hacks for Better Productivity in Emacs</a> <a href="https://systemcrafters.net/build-a-second-brain-in-emacs/5-org-roam-hacks/">shownotes</a></li>
</ol>

<p>
<a href="https://coredumped.dev/2021/05/26/taking-org-roam-everywhere-with-logseq/">Taking org-roam everywhere with logseq</a>
</p>

<p>
KEY - linking roam notes with id's in html -
<a href="https://www.reddit.com/r/emacs/comments/q82zci/how_to_include_the_id_links_into_your_orgroam/">https://www.reddit.com/r/emacs/comments/q82zci/how_to_include_the_id_links_into_your_orgroam/</a>
</p>


<p>
I have found org-roam to be nice to use as I remember, but file naming was
a little strange + I remember I did not like he idea of having a database to
store all the links between notes. Also I was not really using the full
potential and functionalities(graphs, backlinks, etc) that it offered.
</p>

<p>
That is why, when the idea of having a "second-brain" started to creep towards
me, I choose denote. TODO-explain why
</p>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-emacs.html">emacs</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
